package 변수및자료형;

public class Ex02변수명 {

	public static void main(String[] args) {
		// 변수명 작성 규칙!
		// 1. 키워드 사용 불가
		// --> eclipse 작성 시 색깔이 변한다면 키워드!
		
		// 2. 대소문자가 구분되며 길이에 제한이 없다.
		// --> 변수명은 의미전달이 중요하다! a,b,c,d 이렇게 짓지 말기
		// --> int apple과 int Apple은 서로 다르다.
		
		// 3. 숫자로 시작할 수 없다.
		// --> 숫자는 값으로 인식한다.
		// --> int 1a = 0;
		
		// 4. 특수문자는 '_'와 '$'만 허용한다.
		// --> int_a는 허용되지만 int #a는 혀용되지 않는다.
		
		// 자가 개발자에게 권장되는 규칙들!
		// 1. 변수 이름의 첫 글자는 항상 소문자로 시작한다.
		
		// 2. 여러 단어로 이루어진 경우 이어지는 단어의 첫 글자를 대문자로!
		// --> 카멜식 기법(Camel)
		// --> int wishList, int stringBuffer
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
