package ItemSHop;

public class Exoriginal {
	public static void main(String[] args) {
		System.out.println("==================================================================================");
		System.out.println("\r\n"
				+ " ___           _____  ___    _____     _   _  _____  _      _      ___    _     _ \r\n"
				+ "(  _`\\ /'\\_/`\\(  _  )|  _`\\ (_   _)   ( ) ( )(  _  )( )    ( )    (  _`\\ ( )   ( )\r\n"
				+ "| (_(_)|     || (_) || (_) )  | |     | | | || (_) || |    | |    | (_(_)`\\`\\_/'/'\r\n"
				+ "`\\__ \\ | (_) ||  _  || ,  /   | |     | | | ||  _  || |  _ | |  _ |  _)_   `\\ /'  \r\n"
				+ "( )_) || | | || | | || |\\ \\   | |     | \\_/ || | | || |_( )| |_( )| (_( )   | |   \r\n"
				+ "`\\____)(_) (_)(_) (_)(_) (_)  (_)     `\\___/'(_) (_)(____/'(____/'(____/'   (_)   \r\n"
				+ "                                                                                  \r\n"
				+ "                                                                                  \r\n" + "");
		System.out.println("==================================================================================");
		System.out.println();
		System.out.println(
				"═══════════════════════════════════════════════════════════════•°• ⚠ •°•═══════════════════════════════════════════════════════════════");
		System.out.println("\r\n"
				+ "  /^^ ^^  /^^       /^^      /^       /^^^^^^^    /^^^ /^^^^^^ /^^         /^^      /^       /^^      /^^      /^^^^^^^^/^^      /^^\r\n"
				+ "/^^    /^^/^ /^^   /^^^     /^ ^^     /^^    /^^       /^^      /^^       /^^      /^ ^^     /^^      /^^      /^^       /^^    /^^ \r\n"
				+ " /^^      /^^ /^^ / /^^    /^  /^^    /^^    /^^       /^^       /^^     /^^      /^  /^^    /^^      /^^      /^^        /^^ /^^   \r\n"
				+ "   /^^    /^^  /^^  /^^   /^^   /^^   /^ /^^           /^^        /^^   /^^      /^^   /^^   /^^      /^^      /^^^^^^      /^^     \r\n"
				+ "      /^^ /^^   /^  /^^  /^^^^^^ /^^  /^^  /^^         /^^         /^^ /^^      /^^^^^^ /^^  /^^      /^^      /^^          /^^     \r\n"
				+ "/^^    /^^/^^       /^^ /^^       /^^ /^^    /^^       /^^          /^^^^      /^^       /^^ /^^      /^^      /^^          /^^     \r\n"
				+ "  /^^ ^^  /^^       /^^/^^         /^^/^^      /^^     /^^           /^^      /^^         /^^/^^^^^^^^/^^^^^^^^/^^^^^^^^    /^^     \r\n"
				+ "                                                                                                                                    \r\n"
				+ "");
		System.out.println(
				"═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════");
		System.out.println("\r\n"
				+ " ::::::::  ::::    ::::      :::     :::::::::  :::::::::::  :::     :::     :::     :::        :::        :::::::::: :::   ::: \r\n"
				+ ":+:    :+: +:+:+: :+:+:+   :+: :+:   :+:    :+:     :+:      :+:     :+:   :+: :+:   :+:        :+:        :+:        :+:   :+: \r\n"
				+ "+:+        +:+ +:+:+ +:+  +:+   +:+  +:+    +:+     +:+      +:+     +:+  +:+   +:+  +:+        +:+        +:+         +:+ +:+  \r\n"
				+ "+#++:++#++ +#+  +:+  +#+ +#++:++#++: +#++:++#:      +#+      +#+     +:+ +#++:++#++: +#+        +#+        +#++:++#     +#++:   \r\n"
				+ "       +#+ +#+       +#+ +#+     +#+ +#+    +#+     +#+       +#+   +#+  +#+     +#+ +#+        +#+        +#+           +#+    \r\n"
				+ "#+#    #+# #+#       #+# #+#     #+# #+#    #+#     #+#        #+#+#+#   #+#     #+# #+#        #+#        #+#           #+#    \r\n"
				+ " ########  ###       ### ###     ### ###    ###     ###          ###     ###     ### ########## ########## ##########    ###    \r\n"
				+ "");
		System.out.println(
				"═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════");
	}
//	while (true) {
//	System.out.print("[1] 씨앗 구매 [2]수확물 판매 [3]이전으로 >> ");
//	int shopmenuNum = sc.nextInt();
//	if (shopmenuNum == 1) {
//		// 씨앗 구매
//
//		// 1) 구매할 작물 씨앗 선택
//		System.out.println("구매할 씨앗을 선택하세요!");
//		System.out.print("[1] 당근 500G  [2] 토마토 300G  [3] 무 400G  [4] 호박 600G  >> ");
//		int seedmenuNum = sc.nextInt();
//
//		// 1-1) 소지한 골드가 작물 씨앗 가격보다 많을 때
//		if (gold >= tmtsdPrice) { // 1차 판별 : 가장 저렴한 씨앗의 가격보다 소지한 골드가 더 많은지
//			if (seedmenuNum == 1 && gold >= crsdPrice) {
//				gold -= crsdPrice; // 가지고있는 골드에서 산 씨앗 가격만큼 빼줌
//				crsdCount++; // 산 씨얏의 갯수를 1 올려줌
//				System.out.println("당근 씨앗 구매 완료 ! ");
//			} else if (seedmenuNum == 2 && gold >= tmtsdPrice) {
//				gold -= tmtsdPrice;
//				tmtsdCount++;
//				System.out.println("토마토 씨앗 구매 완료 ! ");
//			} else if (seedmenuNum == 3 && gold >= rdsdPrice) {
//				gold -= rdsdPrice;
//				rdsdCount++;
//				System.out.println("무 씨앗 구매 완료 ! ");
//			} else if (seedmenuNum == 4 && gold >= pksdPrice) {
//				gold -= pksdPrice;
//				pksdCount++;
//				System.out.println("호박 씨앗 구매 완료 ! ");
//			} else if (seedmenuNum == 1 && gold < crsdPrice) {
//				System.out.println("씨앗을 구매할 골드가 부족합니다 ! ");
//			} else if (seedmenuNum == 2 && gold < tmtsdPrice) {
//				System.out.println("씨앗을 구매할 골드가 부족합니다 ! ");
//			} else if (seedmenuNum == 3 && gold < rdsdPrice) {
//				System.out.println("씨앗을 구매할 골드가 부족합니다 ! ");
//			} else if (seedmenuNum == 4 && gold < pksdPrice) {
//				System.out.println("씨앗을 구매할 골드가 부족합니다 ! ");
//			} else {
//				System.out.println("구매하고 싶은 씨앗의 번호를 정확하게 입력해주세요!");
//			}
//			System.out.println("당근 씨앗 개수 : " + crsdCount + "개");
//			System.out.println("토마토 씨앗 개수 : " + tmtsdCount + "개");
//			System.out.println("무 씨앗 개수 : " + rdsdCount + "개");
//			System.out.println("호박 씨앗 개수 : " + pksdCount + "개");
//			System.out.println("소지한 골드 : " + gold + "G");
//		}
//		// 1-2) 소지한 골드가 작물 씨앗 가격보다 적을 때
//		else {
//			System.out.println("골드가 부족합니다 ! 수확물을 판매 후 다시 시도하세요 !");
//		}
//	} else if (shopmenuNum == 2) {
//		// 2) 수확물 판매
//		// 판매할 수확물이 하나라도 존재할때 혹은 존재하지 않을 때로 조건문
//		// 수확물이 하나라도 존재할 때
//		if (crCount + tmtCount + rdCount + pkCount != 0) {
//			int salTotal = (crCount * crsalPrice) + (tmtCount * tmtsalPrice) + (rdCount * rdsalPrice)
//					+ (pkCount * pksalPrice);
//			crCount = 0;
//			tmtCount = 0;
//			rdCount = 0;
//			pkCount = 0;
//			gold += salTotal;
//			// 팔았으니까 가지고 있던 수확물 갯수 0으로 초기화
//			System.out.println("소지하고 있는 수확물을 전부 판매했습니다 ! " + "소지한 골드 : " + gold + "G");
//			// 소지한 수확물이 없을 때
//		} else {
//			System.out.println("판매할 수확물이 존재하지 않습니다 !");
//		}
//
//	} else if (shopmenuNum == 3) {
//		// 3) 이전으로
//
//	} else {
//		System.out.println("원하는 메뉴의 번호를 정확하게 입력해주세요!");
//	}
//
//}
}
